Revit 2024 API
BasicFileInfo.Username Property
 Returns the username.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public string Username { get; }
Visual Basic
Public ReadOnly Property Username As String
	Get
Visual C++
public:
property String^ Username {
	String^ get ();
}
See Also
BasicFileInfo Class
Autodesk.Revit.DB Namespace